АлогистикТест2/src/Documents/алк_УстановкаАналитикиНоменклатуры/алк_УстановкаАналитикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_УстановкаАналитикиНоменклатуры</name>
  <registerRecords>InformationRegister.алк_АналитикаНоменклатурыПЭО</registerRecords>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>CatalogRef.алк_ТипНоменклатурыПЭО</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаНоменклатуры</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_АналитикаНоменклатурыПЭО/алк_АналитикаНоменклатурыПЭО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_АналитикаНоменклатурыПЭО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>ТипНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_ТипНоменклатурыПЭО</types>
    </type>
  </resources>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Documents/алк_УстановкаАналитикиНоменклатуры/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр алк_АналитикаНоменклатурыПЭО
	Движения.алк_АналитикаНоменклатурыПЭО.Записывать = Истина;
	Для Каждого ТекСтрокаТаблицаНоменклатуры Из ТаблицаНоменклатуры Цикл
		Движение = Движения.алк_АналитикаНоменклатурыПЭО.Добавить();
		Движение.Период = Дата;
		Движение.Характеристика = ТекСтрокаТаблицаНоменклатуры.Характеристика;
		Движение.КатегорияНоменклатурыПЭО = Категория;
		Движение.ТипНоменклатурыПЭО = Тип;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
